app/views/ticket/_user_home.html.erb

          <td><%= ticket.closed_at %></td>
          <td><%= User.find_by_id(ticket.user_id).username %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1