app/views/ticket/ticket.html.erb

    <%= "Ticket ID: #{@ticket.id}" %><br />
    <%= "User: #{User.find(@ticket.user).username}" %><br />
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]