app/controllers/ticket_controller.rb

SELECT "tickets".* FROM "tickets" WHERE (user = 'davidp' AND closed_at == '')
---
  def index
    ## init? = Init.find_by_id(1)
    ## @init = init?.init
    @init = false
    @all_open_tickets = Ticket.where("closed_at = ?", "")

SELECT "users".* FROM "users" WHERE "users"."username" = '' LIMIT 1
---
  def login
    if request.post?
      if user = User.find_by_username(params[:username])

SELECT "users".* FROM "users" WHERE "users"."username" = 'davidp' LIMIT 1
INSERT INTO "tickets" ("closed_at", "created_at", "description", "opened_at", "service_provider", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def new_ticket
    if request.post?
      user = User.find_by_username(params[:user])
      if !user.nil?
        ticket = Ticket.new do |t|
          t.user_id = user.id
          t.opened_at = params[:opened_at]
          t.closed_at = params[:closed_at]
          t.service_provider = params[:service_provider]
          t.description = params[:description]
        end
        if ticket.save

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 1 LIMIT 1
---
  def ticket ## AKA View Ticket
    @ticket = Ticket.find_by_id(params[:ticket_id])

DELETE FROM "tickets" WHERE "tickets"."id" = 1
---
  def delete
    Ticket.delete(params[:ticket_id])

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 1 LIMIT 1
UPDATE "tickets" SET "updated_at" = '2012-03-11 18:41:53.834301', "closed_at" = '2012-03-11 18:41:53.830575' WHERE "tickets"."id" = 1
---
  def close
    @ticket = Ticket.find_by_id(params[:ticket_id])
    @ticket.update_attributes!(:closed_at => Time.now())

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 2 LIMIT 1
UPDATE "tickets" SET "closed_at" = '', "updated_at" = '2012-03-11 18:58:49.680443' WHERE "tickets"."id" = 2
---
  def open
    @ticket = Ticket.find_by_id(params[:ticket_id])
    @ticket.update_attributes!(:closed_at => "")

SELECT "users".* FROM "users" WHERE (:username != '')
---
  def view_users
    @all_users = User.where("username != ?", "")

INSERT INTO "users" ("created_at", "password", "privilege", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 11 Mar 2012 20:53:13 UTC +00:00], ["password", "davidp"], ["privilege", "user"], ["updated_at", Sun, 11 Mar 2012 20:53:13 UTC +00:00], ["username", "davidp"]]
---
  def add_user
    if request.post?
      user = User.new do |u|
        u.username = params[:username]
        u.password = params[:password]
        u.privilege = params[:privilege]
      end
      if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def user
    @user = User.find_by_id(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def edit_user
    @user = User.find_by_id(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "username" = 'davidp', "updated_at" = '2012-03-11 22:00:02.491564', "privilege" = 'service_provider' WHERE "users"."id" = 2
---
  def update_user
    user = User.find_by_id(params[:user_id])
    user.update_attributes(:username => params[:username],
                           :password => params[:password],
                           :privilege => params[:privilege])