app/controllers/ticket_controller.rb

  def my_tickets
    @my_tickets = []
    @my_tickets = Ticket.find_all_by_user(session[:uname])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user" = 'admin'